{
    "favourite": [
        {
            "id": 2,
            "title": "Ariel",
            "poster_path": "https://image.tmdb.org/t/p/w500/ojDg0PGvs6R9xYFodRct2kdI6wC.jpg",
            "overview": "A Finnish man goes to the city to find a job after the mine where he worked is closed and his father commits suicide.",
            "director": "Aki Kaurismäki",
            "cast": "Merja Pulkkinen, Eetu Hilkamo, Turo Pajala, Esko Salminen, Sami Lanki, Sirkka Rautiainen, Hannu Kivisalo, Tomi Salmela, Mikko Remes, Heikki Salomaa, Veikko Uusimäki, Kari Helaseppä, Timo Markko, Pekka Wilen, Kauko Laalo, Mikko Lyytikäinen, Matti Jaaranen, Esko Nikkari, Timo Harakka, Jorma Markkula, Jouko Lumme, Timo Toikka, Markku Rantala, Heikki Anttila, Pentti Auer, Matti Pellonpää, Hanna Jokinen, Hannu Viholainen, Juuso Hirvikangas, Susanna Haavisto, Jaakko Talaskivi, Tarja Keinänen, Erkki Pajala, Eino Kuusela, Jyrki Olsonen, Marja Packalén, Reijo Marin, Sakari Kuosmanen, Olli Varja",
            "release_date": "1988-10-21",
            "genres": "Comedy, Drama, Romance, Crime",
            "tagline": null,
            "writers": "Aki Kaurismäki"
        },
        {
            "id": 3,
            "title": "Shadows in Paradise",
            "poster_path": "https://image.tmdb.org/t/p/w500/nj01hspawPof0mJmlgfjuLyJuRN.jpg",
            "overview": "Nikander, a rubbish collector and would-be entrepreneur, finds his plans for success dashed when his business associate dies. One evening, he meets Ilona, a down-on-her-luck cashier, in a local supermarket. Falteringly, a bond begins to develop between them.",
            "director": "Aki Kaurismäki",
            "cast": "Esko Nikkari, Mari Rantasila, Marina Martinoff, Jukka-Pekka Palo, Safka Pekkonen, Sakke Järvenpää, Matti Pellonpää, Jussi Tiitinen, Jukka Mäkinen, Kati Outinen, Erkki Rissanen, Mato Valtonen, Ulla Kuosmanen, Ari Korhonen, Pentti Koski, Eskil Mansikka, Sakari Kuosmanen, Bertta Pellonpää, Jaakko Talaskivi, Antti Ortamo, Riikka Kuosmanen, Malla Hukkanen, Sirkka Silin, Kylli Köngäs, Pekka Laiho, Neka Haapanen, Aki Kaurismäki, Helmeri Pellonpää, Olli Varja, Tanja Talaskivi, Svante Korkiakoski, Teuvo Rissanen, Haije Alanoja",
            "release_date": "1986-10-17",
            "genres": "Comedy, Drama, Romance",
            "tagline": null,
            "writers": "Aki Kaurismäki"
        },
        {
            "id": 59,
            "title": "A History of Violence",
            "poster_path": "https://image.tmdb.org/t/p/w500/A26rcvipOqptVs7i5uRmKicXRxE.jpg",
            "overview": "An average family is thrust into the spotlight after the father commits a seemingly self-defense murder at his diner.",
            "director": "David Cronenberg",
            "cast": "Ian Matthews, Brittany Payer, George King, Martha Reilly, Nick Antonacci, Gerry Quigley, Aidan Devine, Kyle Schmid, Bill MacDonald, Shawn Campbell, Deborah Drakeford, Greg Bryk, Stephen McHattie, Heidi Hayes, Peter MacNeill, Maria Bello, Morgan Kelly, Brendan Connor, R.D. Reid, Ed Harris, Ashton Holmes, Viggo Mortensen, William Hurt, Don Allison, Neven Pajkic, Mitch Boughs, Michelle McCree, John Watson, Bruce Beaton, Jason Barbeck, Sumela Kay, April Mullen",
            "release_date": "2005-09-23",
            "genres": "Drama, Thriller, Crime",
            "tagline": "Tom Stall had the perfect life...until he became a hero.",
            "writers": "John Wagner, Josh Olson, Vince Locke"
        },
        {
            "id": 58,
            "title": "Pirates of the Caribbean: Dead Man's Chest",
            "poster_path": "https://image.tmdb.org/t/p/w500/lAhcKRt0ggTFkeFL95jrGQYaRXs.jpg",
            "overview": "Captain Jack Sparrow races to recover the heart of Davy Jones to avoid enslaving his soul to Jones' service, as other friends and foes seek the heart for their own agenda as well.",
            "director": "Gore Verbinski",
            "cast": "Claudia Adams, Jonathan Linsley, Josie Dapar, Luke de Woolfson, Georges Trillat, Robbie Gee, Alex Norton, Kevin McNally, Simon Meacock, San Shella, Michael Miranda, Johnny Depp, Vanessa Branch, Christopher S. Capp, Geoffrey Rush, David Keyes, Lauren Maher, Gerry O'Brien, Michael Enright, Mackenzie Crook, David Schofield, Natsuko Ohama, Barry McEvoy, Steve Speirs, Moray Treadwell, Tom Hollander, David Bailie, John Boswall, Lee Arenberg, Max Baker, Filip Cvijetic, Dermot Keaney, Donald Dowd, David Sterne, Andy Beckwith, Matthew Bowyer, Jonathan Pryce, Orlando Bloom, Jim Cody Williams, Winston Ellis, Bill Nighy, Christopher Adamson, Stellan Skarsgård, Ho-Kwan Tse, Sylver, Anthony Patricio, Derrick O'Connor, Reggie Lee, Keira Knightley, Jack Davenport, Jimmy Roussounis, Jonathan Kite, Peter Donald Badalamenti II, Martin Klebba, Nej Adamson, Neil Panlasigui, Clive Ashborn, Naomie Harris, Israel Aduramo, Hernando \"Sweepy\" Molina",
            "release_date": "2006-07-06",
            "genres": "Adventure, Fantasy, Action",
            "tagline": "Captain Jack is back!",
            "writers": "Stuart Beattie, Terry Rossio, Ted Elliott, Jay Wolpert"
        }
    ],
    "visited": [
        {
            "id": 24,
            "title": "Kill Bill: Vol. 1",
            "poster_path": "https://image.tmdb.org/t/p/w500/v7TaX8kXMXs5yFFGR41guUDNcnB.jpg",
            "overview": "An assassin is shot by her ruthless employer, Bill, and other members of their assassination circle – but she lives to plot her vengeance.",
            "director": "Quentin Tarantino",
            "cast": "Yoshiko Yamaguchi, Vivica A. Fox, Juri Manase, Tetsuro Shimaguchi, Shu Lan Tuan, Goro Daimon, Chiaki Kuriyama, Michael Parks, Yuki Kazamatsuri, Issey Takahashi, Sakichi Sato, Ronnie Yoshiko Fujiyama, Lucy Liu, Yoshiyuki Morishita, Zhang Jinzhan, Kenji Ohba, David Carradine, Uma Thurman, Yoji Tanaka, Sō Yamanaka, Sonny Chiba, Sachiko Fujii, Shun Sugata, Kazuki Kitamura, Hu Xiaohui, Julie Dreyfus, Ai Maeda, Jonathan Loughran, Michael Bowen, Akaji Maro, Ambrosia Kelley, Hikaru Midorikawa, Daryl Hannah, Naomi Kusumi, Gordon Liu Chia-Hui, Michael Madsen, Jun Kunimura, James Parks",
            "release_date": "2003-10-10",
            "genres": "Action, Crime",
            "tagline": "A Roaring Rampage of Revenge",
            "writers": "Quentin Tarantino, Uma Thurman"
        },
        {
            "id": 25,
            "title": "Jarhead",
            "poster_path": "https://image.tmdb.org/t/p/w500/4rCzaZy5Qkvxh5xaVpHriXSLTgC.jpg",
            "overview": "Jarhead is a film about a US Marine Anthony Swofford’s experience in the Gulf War. After putting up with an arduous boot camp, Swofford and his unit are sent to the Persian Gulf where they are eager to fight, but are forced to stay back from the action. Swofford struggles with the possibility of his girlfriend cheating on him, and as his mental state deteriorates, his desire to kill increases.",
            "director": "Sam Mendes",
            "cast": "Chris Cooper, Damion Poitier, Peter Sarsgaard, Nick Dash, James Morrison, Brian Geraghty, John Krasinski, Ming Lo, Evan Jones, Becky Boxer, Dennis Haysbert, Laz Alonso, Jake Gyllenhaal, Jocko Sims, Brianne Davis, Todd Jensen, Jamie Foxx, Martin Papazian, Iván Fenyő, Scott MacDonald, Dendrie Taylor, Merik Tadros, Rini Bell, Kevin Foster, Craig Coyne, Katherine Randolph, Lucas Black, Mark Davis, Jacob Vargas, Riad Galayini, Kareem J. Grimes",
            "release_date": "2005-11-04",
            "genres": "Drama, War",
            "tagline": "Welcome to the suck.",
            "writers": "Anthony Swofford, Sam Chouia, William Broyles Jr."
        }
    ]
}